app/controllers/carts_controller.rb

SELECT "carts".* FROM "carts" WHERE "carts"."id" = ? LIMIT 1  [["id", 1]]
INSERT INTO "orders" ("card_holder_name", "created_at", "order_number", "total", "updated_at") VALUES (?, ?, ?, ?, ?)
UPDATE "carts" SET "status" = 'success', "purchased_at" = '2013-08-20 11:04:10.148113', "updated_at" = '2013-08-20 11:04:10.380529' WHERE "carts"."id" = 1
---
  def payu_return
    notification = PayuIn.notification(request.query_string, options = {:merchant_id => $payu_merchant_id, :secret_key => $payu_secret_key, :params => params})

    @cart = Cart.find(notification.invoice) # notification.invoice is order id/cart id which you have submited from payment direction page.

    if notification.acknowledge
      begin
        if notification.complete?
          @cart.status = 'success'
          @cart.purchased_at = Time.now
          @order = Order.create(:total => notification.gross, :card_holder_name => params['name_on_card'], :order_number => notification.invoice)
          reset_session
          redirect_to @order
        else
          @cart.status = "failed"
          render :text =>"Order Failed! MD5 Hash does not match!"
        end
      ensure
        @cart.save